In [2]:
import pandas as pd

In [7]:
students = pd.read_csv("/Users/mac/Desktop/RISE BCG/Python/students_hyp.csv")

In [8]:
students.head()

    ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70       0     4    1       1     1    57     52     41     47   57
1  121       1     4    2       1     3    68     59     53     63   61
2   86       0     4    3       1     1    44     33     54     58   31
3  141       0     4    3       1     3    63     44     47     53   56
4  172       0     4    2       1     2    47     52     57     53   61

In [11]:
students.shape

(200, 11)

In [13]:
students["School"].unique()

array([1, 2])

In [14]:
students["School"].value_counts()

1    168
2     32
Name: School, dtype: int64

In [24]:
students[["School","Prog"]][["School","Prog"]].value_counts()

School  Prog
1       2       81
        3       48
        1       39
2       2       24
        1        6
        3        2
dtype: int64

In [28]:
pd.crosstab(students["School"], students["Prog"], margins=True)

Prog     1    2   3  All
School
1       39   81  48  168
2        6   24   2   32
All     45  105  50  200

In [32]:
pd.crosstab(students["School"], [students["Race"], students["Prog"]], margins=True)

Race    1         2        3         4          All
Prog    1   2  3  1  2  3  1  2  3   1   2   3
School
1       3  10  9  3  6  1  4  8  6  29  57  32  168
2       1   1  0  1  0  0  1  1  0   3  22   2   32
All     4  11  9  4  6  1  5  9  6  32  79  34  200

### Hypothesis testing

#### Hypothesis 1: Most of the students have marks for math > 80 ? Is this true?

Ho : mean > 80

Ha : mean < = 80 

Sample : 1

In [34]:
import scipy.stats as st

In [36]:
st.ttest_1samp(students["Math1"], 80, alternative = "less")

Ttest_1sampResult(statistic=-41.293726398489476, pvalue=7.581855049773916e-100)

p value is less than alpha (0.05), hence reject null hypothesis

#### Hypothesis 2: Most of the students have marks for read < 60 ? Is this true?

Ho : mu < 60

Ha : mu > = 60

In [37]:
st.ttest_1samp(students["Read"], 60, alternative = "greater")

Ttest_1sampResult(statistic=-10.717357929346454, pvalue=1.0)

p-value is greater than alpha (0.05), hence we should be accepting the hypothesis that marks for read is <60

#### Hypothesis 4: Average mark is a passing mark of 50 ? Is this true?

Ho : mu = 50

Ha : mu != 50

In [38]:
st.ttest_1samp(students["Read"], 50, alternative = "two-sided")

Ttest_1sampResult(statistic=3.075895518975875, pvalue=0.0023938489031348153)

p - value is less than alpha , reject hypothesis. mean does not equal to 50

### 2 Sample t-test

#### Hypothesis 4: The average Math scores of boys and girls are not significantly different

Ho : average math of boys = average math of girls

Ha: average math of boys != average math of girls

In [39]:
students.head()

    ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70       0     4    1       1     1    57     52     41     47   57
1  121       1     4    2       1     3    68     59     53     63   61
2   86       0     4    3       1     1    44     33     54     58   31
3  141       0     4    3       1     3    63     44     47     53   56
4  172       0     4    2       1     2    47     52     57     53   61

In [50]:
students.groupby("Gender")[["Math1"]].mean()

            Math1
Gender
0       52.945055
1       52.394495

In [65]:
boymark = students.loc[ students["Gender"] == 1 , "Math1"] #boys marks
boymark

1      53
92     65
93     52
94     46
95     61
       ..
195    52
196    38
197    57
198    58
199    65
Name: Math1, Length: 109, dtype: int64

In [64]:
girlmark = students.loc[ students["Gender"] == 0 , "Math1"] #girls marks
girlmark

0     41
2     54
3     47
4     57
5     51
      ..
87    39
88    40
89    61
90    66
91    49
Name: Math1, Length: 91, dtype: int64

In [66]:
st.ttest_ind(boymark, girlmark, equal_var=True)

Ttest_indResult(statistic=-0.41299864929688507, pvalue=0.6800544974232143)

p value is less than alpha, reject Ho, boys average marks not significantly different than girls

#### Hypothesis 6: Math 2 marks is after going through a sememster's worth of lesson - working on dependent samples now

Ho: mu(marks1) != mu(marks2) results after lessons has no improvement on student's grades - status quo


Ha: mu(marks1) = mu(marks2) results after lessons has a significant difference

In [68]:
students.loc[:,"Math1"]

0      41
1      53
2      54
3      47
4      57
       ..
195    52
196    38
197    57
198    58
199    65
Name: Math1, Length: 200, dtype: int64

In [69]:
st.ttest_rel(students.loc[:,"Math1"], students.loc[:,"Math2"])

Ttest_relResult(statistic=1.3555927189268238, pvalue=0.1767652560550735)

p value is greater than alpha, accept Ho , means that there has been no improvements, status quo

In [71]:
students.Math1.mean()

52.645

### ANOVA (3-sample in this case) F test
#### Hypothesis 7. programme 1, 2, 3, is there any significant difference in the results for students who went through different prog?

In [74]:
st.f_oneway(students.loc[ students["Prog"] == 1 , "Math1"], 
            students.loc[ students["Prog"] == 2 , "Math1"], 
            students.loc[ students["Prog"] == 3 , "Math1"]
            )

F_onewayResult(statistic=29.279283801321775, pvalue=7.36401083352674e-12)

p value is less than 0.05, reject null hypothesis , there is a change

### Chi-square test of independence

Ho: selection of prog and school are independent

In [76]:
CT = pd.crosstab(students["Prog"], students["School"])
CT

School   1   2
Prog
1       39   6
2       81  24
3       48   2

In [79]:
chi, p, dof, efreq = st.chi2_contingency(CT)

In [80]:
efreq

array([[37.8,  7.2],
       [88.2, 16.8],
       [42. ,  8. ]])

In [81]:
chi

9.268707482993197

In [82]:
p

0.009712381719872817

p value is < 0.05 hence, reject Ho, means that school and program have an influence/associated with each other

### Chi-square test: Goodness of fit